atomvm/AtomVM/src/platforms/esp32/components/avm_sys/platform_nifs.c
static term nif_esp_sleep_enable_gpio_wakeup(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);
    UNUSED(argv);

    esp_err_t ret = esp_sleep_enable_gpio_wakeup();

    return (ret == ESP_OK) ? OK_ATOM : ERROR_ATOM;
}

static term nif_esp_sleep_enable_timer_wakeup(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);

    VALIDATE_VALUE(argv[0], term_is_any_integer);
    avm_int64_t us = term_maybe_unbox_int64(argv[0]);

    esp_err_t ret = esp_sleep_enable_timer_wakeup(us);

    return (ret == ESP_OK) ? OK_ATOM : ERROR_ATOM;
}

#if SOC_ULP_SUPPORTED

static term nif_esp_sleep_enable_ulp_wakeup(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    UNUSED(argv);

    esp_err_t err = esp_sleep_enable_ulp_wakeup();
    if (UNLIKELY(err != ESP_OK)) {
        return ERROR_ATOM;
    }
    return OK_ATOM;
}

#endif

static term nif_atomvm_platform(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argc);
    UNUSED(argv);
    return ESP32_ATOM;
}

static term nif_esp_get_mac(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    GlobalContext *global = ctx->global;

    int network_interface = interop_atom_term_select_int(interface_table, argv[0], global);
    esp_mac_type_t interface;
    switch (network_interface) {
        case WifiSTAInterface:
           interface = ESP_MAC_WIFI_STA;
           break;
        case WifiSoftAPInterface:
           interface = ESP_MAC_WIFI_SOFTAP;
           break;
        default:
            // TODO add support for BT, ETH, etc
            RAISE_ERROR(BADARG_ATOM);
    }

    uint8_t mac[6];
    esp_err_t err = esp_read_mac(mac, interface);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Unable to read mac.  err=%i", err);
        RAISE_ERROR(BADARG_ATOM);
    }

    if (UNLIKELY(memory_ensure_free(ctx, term_binary_heap_size(6)) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    return term_from_literal_binary(mac, 6, &ctx->heap, ctx->global);
}

static term nif_esp_get_default_mac(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    UNUSED(argv);

    uint8_t mac[6];
    esp_err_t err = esp_efuse_mac_get_default(mac);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Unable to read default mac.  err=%i", err);
        return port_create_error_tuple(ctx, esp_err_to_term(ctx->global, err));
    }

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + term_binary_heap_size(6)) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }

    term mac_term = term_from_literal_binary(mac, 6, &ctx->heap, ctx->global);

    term result = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(result, 0, OK_ATOM);
    term_put_tuple_element(result, 1, mac_term);

    return result;
}

#if ESP_TASK_WDT_API
static term parse_task_wdt_config(Context *ctx, esp_task_wdt_config_t *config, term argv[])
{
    VALIDATE_VALUE(argv[0], term_is_tuple);
    size_t tuple_size = term_get_tuple_arity(argv[0]);
    if (tuple_size != 3) {
        RAISE_ERROR(BADARG_ATOM);
    }
    term timeout_ms_term = term_get_tuple_element(argv[0], 0);
    VALIDATE_VALUE(timeout_ms_term, term_is_integer);
    avm_int_t timeout_ms = term_to_int(timeout_ms_term);
    if (timeout_ms <= 0) {
        RAISE_ERROR(BADARG_ATOM);
    }

    term core_mask_term = term_get_tuple_element(argv[0], 1);
    VALIDATE_VALUE(core_mask_term, term_is_integer);
    avm_int_t core_mask = term_to_int(core_mask_term);
    if (core_mask < 0) {
        RAISE_ERROR(BADARG_ATOM);
    }
#ifdef HAVE_SOC_CPU_CORES_NUM
    if (core_mask > 1 << SOC_CPU_CORES_NUM) {
        RAISE_ERROR(BADARG_ATOM);
    }
#else
    if (core_mask > 1 << 2) {
        RAISE_ERROR(BADARG_ATOM);
    }
#endif

    term trigger_panic_term = term_get_tuple_element(argv[0], 2);
    if (trigger_panic_term != TRUE_ATOM && trigger_panic_term != FALSE_ATOM) {
        RAISE_ERROR(BADARG_ATOM);
    }

    config->timeout_ms = timeout_ms;
    config->idle_core_mask = core_mask;
    config->trigger_panic = trigger_panic_term != FALSE_ATOM;

    return OK_ATOM;
}

static term nif_esp_task_wdt_init(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    esp_task_wdt_config_t config;

    if (term_is_invalid_term(parse_task_wdt_config(ctx, &config, argv))) {
        return term_invalid_term();
    }

    esp_err_t result = esp_task_wdt_init(&config);
    if (result == ESP_OK) {
        return OK_ATOM;
    }

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term error_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
    if (result == ESP_ERR_INVALID_STATE) {
        term_put_tuple_element(error_tuple, 1, globalcontext_make_atom(ctx->global, already_started));
    } else {
        term_put_tuple_element(error_tuple, 1, term_from_int(result));
    }
    return error_tuple;
}

static term nif_esp_task_wdt_reconfigure(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);
    esp_task_wdt_config_t config;

    if (term_is_invalid_term(parse_task_wdt_config(ctx, &config, argv))) {
        return term_invalid_term();
    }

    esp_err_t result = esp_task_wdt_reconfigure(&config);
    if (result == ESP_OK) {
        return OK_ATOM;
    }

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term error_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
    if (result == ESP_ERR_INVALID_STATE) {
        term_put_tuple_element(error_tuple, 1, NOPROC_ATOM);
    } else {
        term_put_tuple_element(error_tuple, 1, term_from_int(result));
    }
    return error_tuple;
}

static term nif_esp_task_wdt_deinit(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    esp_err_t result = esp_task_wdt_deinit();
    if (result == ESP_OK) {
        return OK_ATOM;
    }

    term error_tuple = term_alloc_tuple(2, &ctx->heap);
    term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
    term_put_tuple_element(error_tuple, 1, term_from_int(result));

    return error_tuple;
}

static term nif_esp_task_wdt_add_user(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    int ok;
    char *user_name = interop_term_to_string(argv[0], &ok);
    if (UNLIKELY(!ok)) {
        RAISE_ERROR(BADARG_ATOM);
    }
    // Documentation isn't explicit about it, but user name must exist while the user is registered
    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + term_binary_heap_size(sizeof(struct esp_task_wdt_user_handle_and_name))) != MEMORY_GC_OK)) {
        RAISE_ERROR(OUT_OF_MEMORY_ATOM);
    }
    term binary = term_create_empty_binary(sizeof(struct esp_task_wdt_user_handle_and_name), &ctx->heap, ctx->global);
    struct esp_task_wdt_user_handle_and_name *handle = (struct esp_task_wdt_user_handle_and_name *) term_binary_data(binary);
    handle->user_name = user_name;

