atomvm/AtomVM/src/platforms/esp32/components/avm_sys/platform_nifs.c
    esp_err_t result = esp_task_wdt_add_user(handle->user_name, &handle->user_handle);

    term result_tuple;
    if (result == ESP_OK) {
        result_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(result_tuple, 0, OK_ATOM);
        term_put_tuple_element(result_tuple, 1, binary);
    } else {
        result_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(result_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(result_tuple, 1, term_from_int(result));
    }
    return result_tuple;
}

static term nif_esp_task_wdt_reset_user(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    VALIDATE_VALUE(argv[0], term_is_binary);
    size_t binary_size = term_binary_size(argv[0]);
    if (binary_size != sizeof(struct esp_task_wdt_user_handle_and_name)) {
        RAISE_ERROR(BADARG_ATOM);
    }
    struct esp_task_wdt_user_handle_and_name *handle = (struct esp_task_wdt_user_handle_and_name *) term_binary_data(argv[0]);
    esp_err_t result = esp_task_wdt_reset_user(handle->user_handle);
    if (result == ESP_OK) {
        return OK_ATOM;
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        term error_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_tuple, 1, term_from_int(result));
        return error_tuple;
    }
}

static term nif_esp_task_wdt_delete_user(Context *ctx, int argc, term argv[])
{
    UNUSED(argc);

    VALIDATE_VALUE(argv[0], term_is_binary);
    size_t binary_size = term_binary_size(argv[0]);
    if (binary_size != sizeof(struct esp_task_wdt_user_handle_and_name)) {
        RAISE_ERROR(BADARG_ATOM);
    }
    struct esp_task_wdt_user_handle_and_name *handle = (struct esp_task_wdt_user_handle_and_name *) term_binary_data(argv[0]);
    esp_err_t result = esp_task_wdt_delete_user(handle->user_handle);
    if (result == ESP_OK) {
        free(handle->user_name);
        handle->user_name = NULL; // double free shouldn't happen as esp_task_wdt_delete_user should refuse to delete the user again...
        return OK_ATOM;
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
            RAISE_ERROR(OUT_OF_MEMORY_ATOM);
        }
        term error_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_tuple, 1, term_from_int(result));
        return error_tuple;
    }
}
#endif

static term nif_esp_timer_get_time(Context *ctx, int argc, term argv[])
{
    UNUSED(argv);
    UNUSED(argc);

    return term_make_maybe_boxed_int64(esp_timer_get_time(), &ctx->heap);
}

//
// NIF structures and dispatch
//

static const struct Nif esp_random_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_random
};
static const struct Nif esp_random_bytes_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_random_bytes
};
static const struct Nif esp_restart_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_restart
};
static const struct Nif esp_reset_reason_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_reset_reason
};
static const struct Nif esp_freq_hz_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_freq_hz
};
static const struct Nif esp_partition_erase_range_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_partition_erase_range
};
static const struct Nif esp_partition_read_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_partition_read
};
static const struct Nif esp_partition_mmap_nif = {
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_partition_mmap
};
static const struct Nif esp_partition_write_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_partition_write
};
static const struct Nif esp_partition_list_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_partition_list
};
static const struct Nif esp_deep_sleep_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_deep_sleep
};
static const struct Nif esp_light_sleep_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_light_sleep
};
static const struct Nif esp_sleep_get_wakeup_cause_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_get_wakeup_cause
};
#if SOC_PM_SUPPORT_EXT_WAKEUP || SOC_PM_SUPPORT_EXT0_WAKEUP
static const struct Nif esp_sleep_enable_ext0_wakeup_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_enable_ext0_wakeup
};
#endif
#if SOC_PM_SUPPORT_EXT_WAKEUP || SOC_PM_SUPPORT_EXT1_WAKEUP
static const struct Nif esp_sleep_enable_ext1_wakeup_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_enable_ext1_wakeup
};
#endif
#if SOC_PM_SUPPORT_EXT1_WAKEUP && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 2)
static const struct Nif esp_sleep_enable_ext1_wakeup_io_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_enable_ext1_wakeup_io
};
static const struct Nif esp_sleep_disable_ext1_wakeup_io_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_disable_ext1_wakeup_io
};
#endif
#if SOC_GPIO_SUPPORT_DEEPSLEEP_WAKEUP
static const struct Nif esp_deep_sleep_enable_gpio_wakeup_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_deep_sleep_enable_gpio_wakeup
};
#endif
static const struct Nif esp_sleep_enable_gpio_wakeup_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_enable_gpio_wakeup
};
static const struct Nif esp_sleep_enable_timer_wakeup_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_enable_timer_wakeup
};
#if SOC_ULP_SUPPORTED
static const struct Nif esp_sleep_ulp_wakeup_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_sleep_enable_ulp_wakeup
};
#endif
static const struct Nif atomvm_platform_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_atomvm_platform
};
