atomvm/AtomVM/src/platforms/esp32/components/avm_sys/platform_nifs.c
static const struct Nif esp_get_mac_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_get_mac
};
static const struct Nif esp_get_default_mac_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_get_default_mac
};
#if ESP_TASK_WDT_API
static const struct Nif esp_task_wdt_init_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_task_wdt_init
};
static const struct Nif esp_task_wdt_reconfigure_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_task_wdt_reconfigure
};
static const struct Nif esp_task_wdt_deinit_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_task_wdt_deinit
};
static const struct Nif esp_task_wdt_add_user_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_task_wdt_add_user
};
static const struct Nif esp_task_wdt_reset_user_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_task_wdt_reset_user
};
static const struct Nif esp_task_wdt_delete_user_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_task_wdt_delete_user
};
#endif

static const struct Nif esp_timer_get_time_nif =
{
    .base.type = NIFFunctionType,
    .nif_ptr = nif_esp_timer_get_time
};

const struct Nif *platform_nifs_get_nif(const char *nifname)
{
    if (strcmp("atomvm:random/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_random_nif;
    }
    if (strcmp("atomvm:rand_bytes/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_random_bytes_nif;
    }
    if (strcmp("esp:restart/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_restart_nif;
    }
    if (strcmp("esp:reset_reason/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_reset_reason_nif;
    }
    if (strcmp("esp:freq_hz/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_freq_hz_nif;
    }
    if (strcmp("esp:partition_erase_range/2", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_partition_erase_range_nif;
    }
    if (strcmp("esp:partition_erase_range/3", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_partition_erase_range_nif;
    }
    if (strcmp("esp:partition_read/3", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_partition_read_nif;
    }
    if (strcmp("esp:partition_mmap/3", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_partition_mmap_nif;
    }
    if (strcmp("esp:partition_write/3", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_partition_write_nif;
    }
    if (strcmp("esp:partition_list/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_partition_list_nif;
    }
    if (strcmp("esp:deep_sleep/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_deep_sleep_nif;
    }
    if (strcmp("esp:deep_sleep/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_deep_sleep_nif;
    }
    if (strcmp("esp:light_sleep/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_light_sleep_nif;
    }
    if (strcmp("esp:sleep_get_wakeup_cause/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_get_wakeup_cause_nif;
    }
#if SOC_PM_SUPPORT_EXT_WAKEUP || SOC_PM_SUPPORT_EXT0_WAKEUP
    if (strcmp("esp:sleep_enable_ext0_wakeup/2", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_enable_ext0_wakeup_nif;
    }
#endif
#if SOC_PM_SUPPORT_EXT_WAKEUP || SOC_PM_SUPPORT_EXT1_WAKEUP
    if (strcmp("esp:sleep_enable_ext1_wakeup/2", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_enable_ext1_wakeup_nif;
    }
#endif
#if SOC_PM_SUPPORT_EXT1_WAKEUP && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 2)
    if (strcmp("esp:sleep_enable_ext1_wakeup_io/2", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_enable_ext1_wakeup_io_nif;
    }
    if (strcmp("esp:sleep_disable_ext1_wakeup_io/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_disable_ext1_wakeup_io_nif;
    }
#endif
#if SOC_GPIO_SUPPORT_DEEPSLEEP_WAKEUP
    if (strcmp("esp:deep_sleep_enable_gpio_wakeup/2", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_deep_sleep_enable_gpio_wakeup_nif;
    }
#endif
    if (strcmp("esp:sleep_enable_gpio_wakeup/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_enable_gpio_wakeup_nif;
    }
    if (strcmp("esp:sleep_enable_timer_wakeup/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_enable_timer_wakeup_nif;
    }
#if SOC_ULP_SUPPORTED
    if (strcmp("esp:sleep_ulp_wakeup/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_sleep_ulp_wakeup_nif;
    }
#endif
    if (strcmp("atomvm:platform/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &atomvm_platform_nif;
    }
    if (strcmp("esp:get_mac/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_get_mac_nif;
    }
    if (strcmp("esp:get_default_mac/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_get_default_mac_nif;
    }
#if ESP_TASK_WDT_API
    if (strcmp("esp:task_wdt_init/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_task_wdt_init_nif;
    }
    if (strcmp("esp:task_wdt_reconfigure/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_task_wdt_reconfigure_nif;
    }
    if (strcmp("esp:task_wdt_deinit/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_task_wdt_deinit_nif;
    }
    if (strcmp("esp:task_wdt_add_user/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_task_wdt_add_user_nif;
    }
    if (strcmp("esp:task_wdt_reset_user/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_task_wdt_reset_user_nif;
    }
    if (strcmp("esp:task_wdt_delete_user/1", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_task_wdt_delete_user_nif;
    }
#endif
    if (strcmp("esp:timer_get_time/0", nifname) == 0) {
        TRACE("Resolved platform nif %s ...\n", nifname);
        return &esp_timer_get_time_nif;
    }
    const struct Nif *nif = nif_collection_resolve_nif(nifname);
    if (nif) {
        return nif;
    }
    return NULL;
}
